/*****************************************************************************

  module_or_Class <TODO: заменить на имя модуля/класса>

  Модуль/Класс ... <TODO: краткое описание назначения в одном предложении (должно быть идентично в .h и .cpp)>


  ОПИСАНИЕ <TODO: описание функций и возможностей класса/модуля, форматов используемых данных и т.д., если не очевидно>

  * ...
  * ...
  * ...


  ИСПОЛЬЗОВАНИЕ <TODO: описания правил инициализации и использования, последовательности вызова интерфейсных функций, ограничений и т.д., если не очевидно>

  * ...
  * ...
  * ...


  ПРИМЕЧАНИЯ <TODO: особенности и замечания, не вошедшие в предыдущие разделы (при необходимости)>

  * ...
  * ...

  <TODO: при использовании тематических подразделов в разделах ОПИСАНИЕ, ИСПОЛЬЗОВАНИЕ
         выполнять их нумерацию в соответствии с уровнями вложенности.
         Тематические подразделы вводятся для описания различных аспектов
         функционирования, форматов используемых данных и пр.>

*****************************************************************************/

#pragma once

#include <iostream>
#include <thread>
#include <chrono>
#include <vector>
#include <utility>
#include <map>
#include <cerrno>

#include "I_Socket.h"
#include "SocketCreator.h"
#include "C_UdpSocket.h"
#include "Config.h"

namespace myTask {

/*****************************************************************************
  Macro Definitions
*****************************************************************************/

/*****************************************************************************
  Forward Declarations
*****************************************************************************/

/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/

class C_TcpSocket : public I_Socket
{
public:
    C_TcpSocket();

    virtual ~C_UdpSocket();


};


/*****************************************************************************
  Functions Prototypes
*****************************************************************************/

/*****************************************************************************
  Variables Declarations
*****************************************************************************/

/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/


} // namespace myTask

