 /*****************************************************************************

  Config

  Описание типов конфигурации для клиента/сервера

  ОПИСАНИЕ TODO назначение, функции и возможности модуля

  * ...
  * ...
  * ...


  ИСПОЛЬЗОВАНИЕ TODO основные сведения для использования при необходимости

  * ...
  * ...
  * ...

*****************************************************************************/

#pragma once
#include <vector>
#include <string>


namespace myTask {

/*****************************************************************************
  Macro Definitions
*****************************************************************************/

/*****************************************************************************
  Forward Declarations
*****************************************************************************/

/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/

//using conf_t = std::map< std::string, std::vector<std::string> >;

//using param_t = std::pair< string, string >;

struct param_t {
    std::string name;
    std::string value;
};

using conf_t = std::vector<param_t>;

//conf.emplace_back( "a", "b" );
//conf.push_back( { "a", "b" } );

/*****************************************************************************
  Functions Prototypes
*****************************************************************************/

extern std::string findValByKey(const conf_t& a_conf, const std::string& a_key);

/*****************************************************************************
  Variables Deсlarations
*****************************************************************************/

/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/

} // namespace myTask
