/*****************************************************************************

  i_Socket

  Предоставляет минимально необходимые методы для реализаци сокета


  ИСПОЛЬЗОВАНИЕ

  * Необходимо реализовать все методы представленные в классе интерфейса

*****************************************************************************/

#pragma once
#ifndef WIN32_LEAN_AND_MEAN
#define WIN32_LEAN_AND_MEAN

#endif

#include "i_socket.h"

#include <winsock2.h>
#include <windows.h>
#include <ws2tcpip.h>
#include <iphlpapi.h>
#include <iostream>
#include <thread>
#include <chrono>

namespace myTask {

/*****************************************************************************
  Macro Definitions
*****************************************************************************/

/*****************************************************************************
  Forward Declarations
*****************************************************************************/

/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/


class I_Socket
{

public:

    // Запуск сокета
    virtual bool setup();

    // Cвязывание сокет с локальным адресом протокола
    virtual bool open();

    // Получение данных
    virtual bool recv();

    // Отправка данных
    virtual bool send();

    // Закрытие сокета
    virtual bool flush();


};



/*****************************************************************************
  Functions Prototypes
*****************************************************************************/

/*****************************************************************************
  Variables Deсlarations
*****************************************************************************/

/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/

} // namespace myTask
