/*****************************************************************************

  I_SocketCreator

  Функция-фабрика создания сокета


  ИСПОЛЬЗОВАНИЕ

  * Объявляет фабричный метод, возвращающий объект типа I_Socket.
    Creator может также определять реализацию по умолчанию фабричного
    метода, который возвращает объект ConcreteProduct;
  * может вызывать фабричный метод для создания объекта I_Socket.
  * I_Socket – определяет интерфейс объектов, создаваемых фабричным методом;
  * Определяет интерфейс для создания объекта, но оставляет подклассам
    решение о том, какой класс инстанцировать. Фабричный метод - FactoryMethod()
    позволяет классу делегировать инстанцирование подклассам.

*****************************************************************************/

#pragma once

#include <string>

#include "I_Socket.h"
#include "C_UdpSocket.h"

namespace myTask {

/*****************************************************************************
  Macro Definitions
*****************************************************************************/

/*****************************************************************************
  Forward Declarations
*****************************************************************************/

/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/

/*****************************************************************************
  Functions Prototypes
*****************************************************************************/

// Создатель сокета соответствующего переданному ключу
I_Socket * CreateSocket( std::string a_protoName );

/*****************************************************************************
  Variables Deсlarations
*****************************************************************************/

/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/

} // namespace myTask


