/*****************************************************************************

  I_SocketCreator

  Функция-фабрика создания интерфейса обмена


  ИСПОЛЬЗОВАНИЕ

  * Объявляет фабричный метод, возвращающий объект типа I_Socket.
    Creator может также определять реализацию по умолчанию фабричного
    метода, который возвращает объект ConcreteProduct;
  * может вызывать фабричный метод для создания объекта I_Socket.
  * I_Socket – определяет интерфейс объектов, создаваемых фабричным методом;
  * Определяет интерфейс для создания объекта, но оставляет подклассам
    решение о том, какой класс инстанцировать. Фабричный метод - FactoryMethod()
    позволяет классу делегировать инстанцирование подклассам.


  ПОДДЕРЖИВАЕМЫЕ ТИПЫ ИНТЕРФЕЙСОВ

    "UDP"   - C_UdpSocket
    "..."   - ...

*****************************************************************************/

#pragma once

#include <string>

#include "I_Connection.h"

namespace myTask {

/*****************************************************************************
  Macro Definitions
*****************************************************************************/

/*****************************************************************************
  Forward Declarations
*****************************************************************************/

/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/

/*****************************************************************************
  Functions Prototypes
*****************************************************************************/

// Создание интерфейса обмена заданного типа
I_Connection * createSocket( const std::string &a_type );

/*****************************************************************************
  Variables Deсlarations
*****************************************************************************/

/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/

} // namespace myTask


