/*****************************************************************************

  I_SocketCreator

  Интерфейс фабрики создания сокета




*****************************************************************************/

#include "i_socketcreator.h"


/*****************************************************************************
  Macro Definitions
*****************************************************************************/


namespace myTask{
/*****************************************************************************
  Forward Declarations
*****************************************************************************/


/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/



/*****************************************************************************
  Functions Prototypes
*****************************************************************************/

/****************************************************************************
 * Создает и возвращает объект-сокет в сооветствии с переданным ключом
 *
 * Метод получает имя протокола сокета и если имеется реализация конкретной
 * фабрики данного протокола, то возвращает объект с интерфейсом I_Socket и
 * реализованным в соответствии с переданным протоколом.
 *
 * [in] protoName - имя протокола
 *
 * @return
 */
I_Socket * CreateSocket(std::__cxx11::string a_protoName) {
    if( a_protoName.compare("UDP") == 0 ) {
        I_Socket* mySock = new C_UDPSocket;
        return mySock;
    }

    return nullptr;
}


/*****************************************************************************
  Variables Deсlarations
*****************************************************************************/


/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/


} // namespace myTask

