/*****************************************************************************

  I_SocketCreator

  Интерфейс фабрики создания сокета

  ИСПОЛЬЗОВАНИЕ

  * Объявляет фабричный метод, возвращающий объект типа I_Socket.
    Creator может также определять реализацию по умолчанию фабричного
    метода, который возвращает объект ConcreteProduct;
  * может вызывать фабричный метод для создания объекта I_Socket.
  * I_Socket – определяет интерфейс объектов, создаваемых фабричным методом;
  * Определяет интерфейс для создания объекта, но оставляет подклассам
    решение о том, какой класс инстанцировать. Фабричный метод - FactoryMethod()
    позволяет классу делегировать инстанцирование подклассам.


*****************************************************************************/

#pragma once

#include <string>

#include "i_socket.h"

#include "C_UdpSocket.h"


/*****************************************************************************
  Macro Definitions
*****************************************************************************/

namespace myTask {
/*****************************************************************************
  Forward Declarations
*****************************************************************************/


/*****************************************************************************
  Types and Classes Definitions
*****************************************************************************/

    // Фабричный метод создания сокета
    I_Socket * CreateSocket( std::string a_protoName );


/*****************************************************************************
  Functions Prototypes
*****************************************************************************/


/*****************************************************************************
  Variables Deсlarations
*****************************************************************************/


/*****************************************************************************
  Inline Functions Definitions
*****************************************************************************/

} // namespace myTask


